In [114]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [115]:
player = len(pd.unique(purchase_data['SN']))
unique = len(pd.unique(purchase_data['Item ID']))
mean = round(purchase_data['Price'].mean(),2)
purchase = len(purchase_data['SN'])
revenue = purchase_data['Price'].sum(axis = 0, skipna = True)

In [116]:
data = {'Number of Unique Items' : [unique], 'Average Price' : [mean], 'Number of Purchases' : [purchase], 'Total Revenue' : [revenue]}
pd.DataFrame(data = data)

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

In [118]:
clean_data = purchase_data.drop_duplicates(subset= ["SN"])
clean_data['Gender'].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [10]:
round(clean_data['Gender'].value_counts(normalize=True)*100, 2)

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [11]:
summary_by_gender = {'Gender' : ['Female', 'Male', 'Other/Non-disclosed'],
                     'Total Count' : ['484' , '81', '11'],
                     'Percentage of Players': ['84.03%', '14.06%', '1.91%']
                        }
df1 = pd.DataFrame(data =summary_by_gender)
df1.set_index('Gender')

                    Total Count Percentage of Players
Gender
Female                      484                84.03%
Male                         81                14.06%
Other/Non-disclosed          11                 1.91%

In [130]:
purchase_count = purchase_data['Gender'].value_counts()
purchase_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [121]:
average_purchase_price = purchase_data[ ['Gender', 'Price']]
round(average_purchase_price.groupby('Gender').mean(), 2)

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [122]:
total_purchase_value = round(gender_price.groupby('Gender').sum(), 2)
total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [123]:
avg_per_person = round(gender_sum['Price'] / gender_count, 2)
avg_per_person

Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [16]:
data_by_gender = {'Gender' : ['Female', 'Male', 'Other/Non-disclosed'],
                  'Purchase Count' : ['113', '652', '15'],
                  'Average Purchase Price' : ['$3.20', '$3.02', '$3.35'],
                  'Total Purchase Value' : ['$361.94' , '$1967.64', '$50.19'],
                  'Avg Total Purchase per Person' : ['$4.47', '$4.07' , '$4.56']
                 }
df2 = pd.DataFrame(data =data_by_gender)
df2.set_index('Gender')

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other/Non-disclosed,15,$3.35,$50.19,$4.56

In [126]:
bins = [0,10,15,20,25,30,35,40, 46]
labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+' ]
purchase_data['Bins'] = pd.cut(purchase_data.Age, bins, labels = labels, include_lowest = True, right=False)

In [128]:
clean_data = purchase_data.drop_duplicates(subset= ["SN"])
total_count = clean_data['Bins'].value_counts()
total_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Bins, dtype: int64

In [36]:
percentage_of_players = round(clean_data['Bins'].value_counts(normalize=True)*100, 2)
percentage_of_players

20-24    44.79
15-19    18.58
25-29    13.37
30-34     9.03
35-39     5.38
10-14     3.82
<10       2.95
40+       2.08
Name: Bins, dtype: float64

In [34]:
bins_percentage = {"Age Range" : ["<10", "10-14", "15-19", "20-24", "25-29", "30-24", "35-39", "40+"],
                   "Total Count" : ["17", "22", "107", "258", "77", "52", "31", "12"],
                   "Percentage of Players" : ["2.95%" , "3.82%", "18.58%", "44.79%", "13.37%", "9.03%", "5.38%", "2.08%"],
}
percentage_by_age = pd.DataFrame(data=bins_percentage)
percentage_by_age.set_index("Age Range")

          Total Count Percentage of Players
Age Range
<10                17                 2.95%
10-14              22                 3.82%
15-19             107                18.58%
20-24             258                44.79%
25-29              77                13.37%
30-24              52                 9.03%
35-39              31                 5.38%
40+                12                 2.08%

In [37]:
gender_price2 = purchase_data[ ['Bins', 'Price']]
average_purchase_price = round(gender_price2.groupby('Bins').mean(), 2)
average_purchase_price

       Price
Bins
<10     3.35
10-14   2.96
15-19   3.04
20-24   3.05
25-29   2.90
30-34   2.93
35-39   3.60
40+     2.94

In [40]:
total_purchase_value = round(gender_price2.groupby('Bins').sum(), 2)
total_purchase_value

         Price
Bins
<10      77.13
10-14    82.78
15-19   412.89
20-24  1114.06
25-29   293.00
30-34   214.00
35-39   147.67
40+      38.24

In [38]:
average_total_purchase_per_person = round(bins_sum['Price'] / bins_count, 2)
average_total_purchase_per_person

<10      4.54
10-14    3.76
15-19    3.86
20-24    4.32
25-29    3.81
30-34    4.12
35-39    4.76
40+      3.19
dtype: float64

In [47]:
bin_data = {"Age Range" : ["<10", "10-14", "15-19", "20-24", "25-29", "30-24", "35-39", "40+"],
            "Purchase Count" : ["23", "28", "136", "365", "101", "73", "41", "13"],
            "Average Purchase Price" : ["3.35", "2.96", "3.04", "3.05", "2.90", "2.93", "3.60", "2.94"],
            "Total Purchase Value" : ["77.13", "82.78", "412.89", "1114.06", "293.00", "214.00", "147.67", "38.24"],
            "Average Total Purchase per Person" : ["4.54", "3.76", "3.86", "4.32", "3.81", "4.12", "4.76", "3.19"]
}
bin_data_df = pd.DataFrame(data=bin_data)
bin_data_df.set_index("Age Range")

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Age Range,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-24,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [52]:
total_purchase_value = purchase_data.groupby('SN').sum()
total_purchase_value.sort_values(by='Price', ascending=False).head(5)

             Purchase ID  Age  Item ID  Price
SN
Lisosia93           1630  125      442  18.96
Idastidru52         1999   96      527  15.45
Chamjask73          1306   66      339  13.83
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10

In [76]:
most_buyer = purchase_data.set_index('SN')

In [77]:
most_buyer.loc['Lisosia93', 'Age'].value_counts()

25    5
Name: Age, dtype: int64

In [78]:
most_buyer.loc['Idastidru52', 'Age'].value_counts()

24    4
Name: Age, dtype: int64

In [79]:
most_buyer.loc['Chamjask73', 'Age'].value_counts()

22    3
Name: Age, dtype: int64

In [80]:
most_buyer.loc['Iral74', 'Age'].value_counts()

21    4
Name: Age, dtype: int64

In [81]:
most_buyer.loc['Iskadarya95', 'Age'].value_counts()

20    3
Name: Age, dtype: int64

In [82]:
most_buyer.loc['Lisosia93', 'Price'].sum()/most_buyer.loc['Lisosia93', 'Age'].value_counts()

25    3.792
Name: Age, dtype: float64

In [83]:
most_buyer.loc['Idastidru52', 'Price'].sum()/most_buyer.loc['Idastidru52', 'Age'].value_counts()

24    3.8625
Name: Age, dtype: float64

In [84]:
most_buyer.loc['Chamjask73', 'Price'].sum()/most_buyer.loc['Chamjask73', 'Age'].value_counts()

22    4.61
Name: Age, dtype: float64

In [85]:
most_buyer.loc['Iral74', 'Price'].sum()/most_buyer.loc['Iral74', 'Age'].value_counts()

21    3.405
Name: Age, dtype: float64

In [86]:
most_buyer.loc['Iskadarya95', 'Price'].sum()/most_buyer.loc['Iskadarya95', 'Age'].value_counts()

20    4.366667
Name: Age, dtype: float64

In [93]:
most_buyer_data = {"SN" : ["Lisosia93", "Idastidru52", "Chamjask73", "Iral74","Iskadarya95" ],
                   "Purchase_count": ["5", "4", "3", "4", "3"],
                   "Average Purchase Price" : ["3.792", "3.8625", "4.61", "3.405", "4.36667"],
                   "Total Purchase Value" : ["18.96", "15.45", "13.83", "13.62", "13.10"]
}
pd.DataFrame(data=most_buyer_data).set_index('SN')

            Purchase_count Average Purchase Price Total Purchase Value
SN
Lisosia93                5                  3.792                18.96
Idastidru52              4                 3.8625                15.45
Chamjask73               3                   4.61                13.83
Iral74                   4                  3.405                13.62
Iskadarya95              3                4.36667                13.10

In [65]:
purchase_data[ ['Item ID', 'Item Name', 'Price']]
purchase_data[['Item ID', 'Item Name']].value_counts()

Item ID  Item Name
92       Final Critic                                    13
178      Oathbreaker, Last Hope of the Breaking Storm    12
145      Fiery Glass Crusader                             9
132      Persuasion                                       9
108      Extraction, Quickblade Of Trembling Hands        9
                                                         ..
42       The Decapitator                                  1
51       Endbringer                                       1
118      Ghost Reaver, Longsword of Magic                 1
104      Gladiator's Glaive                               1
91       Celeste                                          1
Length: 179, dtype: int64

In [58]:
item_index = purchase_data.set_index('Item ID')

In [103]:
print(item_index.loc[ 92 , 'Price'].sum())
item_index.loc[ 92 , 'Price'].sum()/13

59.99

4.614615384615385

In [104]:
print(item_index.loc[ 178 , 'Price'].sum())
item_index.loc[ 178 , 'Price'].sum()/12

50.76000000000002

4.230000000000001

In [105]:
print(item_index.loc[145 , 'Price'].sum())
item_index.loc[145 , 'Price'].sum()/9

41.22

4.58

In [106]:
print(item_index.loc[ 132 ,'Price'].sum())
item_index.loc[ 132 ,'Price'].sum()/9

28.989999999999995

3.2211111111111106

In [107]:
print(item_index.loc[ 108 , 'Price'].sum())
item_index.loc[ 108 , 'Price'].sum()/9

31.77

3.53

In [112]:
most_popular_item = { "Item ID" : ["92", "178", "82", "145", "103"],
                     "Item Name" : ["Final Critic", "Oathbreaker, Last Hope of the Breaking Storm",
                                   "Nirvana", "Fiery Glass Crusader", "Singed Scalpel"],
                     "Purchase Count" : ["13", "12", "9", "9", "9"],
                     "Item Price" : ["$4.61", "$4.23", "$4.90", "$4.58", "$4.35"],
                     "Total Purchase Value" : ["$59.99", "$50.76", "$44.10", "$41.22", "$34.80"]
 
}
pd.DataFrame(data=most_popular_item).set_index(['Item ID', 'Item Name'])

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,9,$4.35,$34.80